fn main() {
    let mut x = 5;

    const MAX_POINT: u32 = 100_000;

    println!("Значение x равно {}", x);
    x = 6;
    println!("Значение x равно {}", x);
    x = MAX_POINT;
    println!("Const = {}", x);

    let a = 5; // тип по умолчанию

    let a = a + 1;

    let a = a * 2;

    println!("Значение a равно {}", a);

    let spaces = " ";
    let spaces = spaces.len();
    println!("Num {}", spaces);

    let mut spaces = " ";
    // spaces = spaces.len(); Нельзя менять тип переменной таким образом

    let guess: u32 = "42".parse().expect("Не является числом!"); //При изменении типов аннотация необходима
    println!("{}", guess);

    let x = 2.0; //f64

    let y: f32 = 3.0; //f32

    // Сложение
    let sum = 5 + 10;

    // Вычитание
    let difference = 95.5 - 4.3;

    // Умножение
    let product = 4 * 30;

    // Деление
    let quotient = 56.7 / 32.2;

    // Остаток
    let remainder = 43 % 5;

    let t = true;

    let f: bool = false; // явная аннотация типа

    let c = 'z'; // символьные литералы задаются одинарными кавычками
    // в отличие от строковых литералов, которые используют двойные кавычки

    let z = 'ƶ';

    let heart_eyed_cat = '😻';


}
