// mod front_of_house {                // Модуль определяется с помощью ключевого слова mod, после которого указывается имя модуля
//     mod hosting {                   // Вокруг тела модуля размещаются фигурные скобки 
//         fn add_to_waitlist() {}     // Внутри модулей могут быть другие модули, как в данном примере
//                                     // Модули также могут содержать определения других элементов, таких как структуры, перечисления, константы, типажи и функции
//         fn seat_at_table() {}
//     }                               
                                    
//     mod serving {
//         fn take_order() {}

//         fn serve_order() {}

//         fn take_payment() {}
//     }
// }


// crate                             // Стоит упомянуть, что src/main.rs и src/lib.rs называются корнями упаковки потому что, содержимое любого из этих двух
//  └── front_of_house               // файлов формирует модуль с именем crate ("упаковка") в корне модульной упаковочной структуры, именуемой деревом модулей
//      ├── hosting
//          |                        // Для того чтобы показать языку Rust, как в дереве модулей отыскать элемент, используется путь точно так же, как во время навигации по файловой системе
//          ├── add_to_waitlist      // Путь может принимать две формы: Абсолютный путь начинается с корня упаковки, используя имя упаковки либо литерал crate
//          |                        // Относительный путь начинается с текущего модуля и использует self, super или идентификатор в текущем модуле
//          └── seat_at_table           
//      └── serving                  // Как абсолютные, так и относительные пути сопровождаются одним или несколькими идентификаторами, разделенными двойными двоеточиями (::)
//          ├── take_order
//          ├── serve_order
//          └── take_payment

    fn main() {
        
    }

    // mod front_of_house {                                       // Функция eat_at_restaurant является частью публичного API библиотечной упаковки, поэтому она помечается ключевым словом pub
    //     pub mod hosting {
    //         pub fn add_to_waitlist() {}
    //     }
    // }

    // pub fn eat_at_restaurant() {                               // Так как функция add_to_waitlist определена в той же упаковке, что и функция eat_at_restaurant, то можно использовать ключевое слово crate
    //     // Абсолютный путь                                     // для начала абсолютного пути
    //     crate::front_of_house::hosting::add_to_waitlist();

    //     // Относительный путь                                  // Относительный путь здесь начинается с имени модуля, определенного на том же уровне дерева модулей, что и eat_at_restaurant
    //     front_of_house::hosting::add_to_waitlist();
    // }


    // fn serve_order() {}

    // mod back_of_house {
    //     fn fix_incorrect_order() {
    //         cook_order();
    //         super::serve_order();
    //     }

    //     fn cook_order() {}
    // }

// Листинг 7.9. Структура, в которой несколько публичных и конфиденциальных полей

    // mod back_of_house {                                             // Также можно использовать ключевое слово pub для обозначения структур и перечислений как публичных
    //     pub struct Breakfast {                                      // Если pub используется перед определением структуры, то структура становится публичной, но поля
    //         pub toast: String,                                     // структуры все равно будут конфиденциальными. Напротив, можно сделать каждое поле публичным на
    //         seasonal_fruit: String,                                 // индивидуальной основе
    //     }

    //     impl Breakfast {
    //         pub fn summer(toast: &str) -> Breakfast {
    //             Breakfast {
    //                 toast: String::from(toast),
    //                 seasonal_fruit: String::from("персики"),
    //             }
    //         }
    //     }

    //     pub enum Appetizer {                                            // Напротив, если сделать перечисление публичным, то тогда все его варианты будут публичными, в отличии от полей структуры
    //         Soup,
    //         Salad,
    //     }
    // }

    // pub fn eat_at_restaurant() {
    //     // Заказать летом завтрак с ржаным тостом
    //     let mut meal = back_of_house::Breakfast::summer("ржаной");
    //     // Изменить мнение о том, какой хлеб мы бы хотели
    //     meal.toast = String::from("пшеничный");
    //     println!("Я бы хотел {} тост, пожалуйста", meal.toast);

    //     // Следующая строка не будет компилироваться, если мы раскомментируем ее;
    //     // нам запрещено просматривать или изменять сезонные фрукты,
    //     // которые принесут с едой
    //     // meal.seasonal_fruit = String::from("черника");

    //     let order1 = back_of_house::Appetizer::Soup;
    //     let order2 = back_of_house::Appetizer::Salad;
    // }


    /*mod front_of_house {
        pub mod hosting {
            pub fn add_to_waitlist() {}
        }
    }

    use crate::front_of_house::hosting;     // Бдагодаря добавлению use crate::front_of_house::hosting в корень упаковки 
                                            // модуль  hosting сейчас является допустимым именем в этой области видимости, 
    pub fn eat_at_restaurant() {            // как будто модуль hosting был определен в корне упаковки
        hosting::add_to_waitlist();         // Пути, введенные с помощью use, проверяют конфиденциальность так же, как и 
        hosting::add_to_waitlist();         // любые другие пути
        hosting::add_to_waitlist();
    }
    */


    mod front_of_house {
        pub mod hosting {
            pub fn add_to_waitlist() {}
        }
    }

    use self::front_of_house::hosting;

    pub fn eat_at_restaurant() {            // Вместо того, чтобы начинать с имени в текущей области видимости, нужно начинать
        hosting::add_to_waitlist();         // путь, переданный инструкции use, с ключевого слова self
        hosting::add_to_waitlist();         // Следует обратить внимание, что подобное использование self в будущем может не 
        hosting::add_to_waitlist();         // понадобиться. Оно представляет собой нестыковку в языке, над устранением которой
    }                                       // работают разработчики Rust