fn main() {
    // let width1 = 30;
    // let height1 = 50;

    // println!(
    //     "Площадь проямоугольника равна {} квадратным пикселям.",
    //     area(width1, height1)
    // );

    let rect1 = (30, 50);                                                               // Указание ширины и высоты прямоугольника с 
                                                                                        // помощью кортежа 
}

fn area(width1: u32, height1: u32) -> u32 {                                             // Функция для расчета площади прямоугольника
    width1 * height1
}
